       IDENTIFICATION DIVISION.
       PROGRAM-ID. Exemple.
       SCREEN SECTION.
       1 pla.
           2 BLANK SCREEN.
           2 LINE 1 COL 1 VALUE 'Hello world !'.

       PROCEDURE DIVISION.
       DISPLAY pla.
       STOP RUN.
